# SpotSlopeLeaderLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotSlopeLeaderLength Property
ParameterTypeId Class See Also
---
"Leader Line Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotSlopeLeaderLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotSlopeLeaderLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotSlopeLeaderLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace